In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("Restaurant - Customers.csv")

In [4]:
df.head()

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive
3   4     Steven     Evans    Male     Fatz               Registered Nurse
4   5       Judy  Morrison  Female  Demivee                Legal Assistant

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          1000 non-null   int64
 1   First Name  1000 non-null   object
 2   Last Name   1000 non-null   object
 3   Gender      1000 non-null   object
 4   Company     1000 non-null   object
 5   Occupation  1000 non-null   object
dtypes: int64(1), object(5)
memory usage: 47.0+ KB

In [7]:
len(df["First Name"].unique())

198

In [8]:
len(df["Last Name"].unique())

248

In [9]:
df["First Name"].value_counts()

First Name
Steven     11
Amanda     10
Jesse      10
Melissa    10
Gary        9
           ..
Eugene      2
Heather     1
Nancy       1
Ann         1
Karen       1
Name: count, Length: 198, dtype: int64

In [10]:
df["Gender"].value_counts()

Gender
Male      500
Female    500
Name: count, dtype: int64

In [11]:
len(df["Company"].unique())

353

In [15]:

ImePrezime = df['First Name'] + ' ' + df['Last Name']

ImePrezime

0        Joseph Perkins
1      Jennifer Alvarez
2           Roger Black
3          Steven Evans
4         Judy Morrison
             ...
995        Debra Garcia
996      Douglas Bishop
997      Frank Franklin
998       Jessica Burns
999       Brian Daniels
Length: 1000, dtype: object

In [19]:
df.loc[df["First Name"].idxmax()]

ID                 295
First Name      Willie
Last Name         King
Gender            Male
Company       Flipopia
Occupation      Editor
Name: 294, dtype: object

In [26]:
df['Duzina imena']= df['First Name'].apply(len)
df.loc[df['Duzina imena'].idxmax()]

ID                                   143
First Name                   Christopher
Last Name                           Long
Gender                              Male
Company                           Mybuzz
Occupation      Accounting Assistant III
Duzina imena                          11
Name: 142, dtype: object

In [29]:
df.replace(['Male', 'Female'], ['M', 'F'], inplace=True)

In [32]:
df.drop(['ID', 'Duzina imena'], axis=1, inplace=True)

In [33]:
df

    First Name Last Name Gender       Company                     Occupation
0       Joseph   Perkins      M       Dynazzy  Community Outreach Specialist
1     Jennifer   Alvarez      F          DabZ        Senior Quality Engineer
2        Roger     Black      M       Tagfeed              Account Executive
3       Steven     Evans      M          Fatz               Registered Nurse
4         Judy  Morrison      F       Demivee                Legal Assistant
..         ...       ...    ...           ...                            ...
995      Debra    Garcia      F  Dazzlesphere            Structural Engineer
996    Douglas    Bishop      M      Livepath                    Developer I
997      Frank  Franklin      M    Brainverse             Nurse Practicioner
998    Jessica     Burns      F    Babbleblab              Financial Advisor
999      Brian   Daniels      M         Tazzy     Physical Therapy Assistant

[1000 rows x 5 columns]